#include<stdio.h>
/*
    进阶篇
    整型数据的存储
*/

void test1(){
    int a = -20;
    unsigned b = 10;
    /*
    -20原码：10000000 00000000 00000000 00010100
       反码：11111111 11111111 11111111 11101011
       补码：11111111 11111111 11111111 11101100

     10原码：00000000 00000000 00000000 00001010
       反码：00000000 00000000 00000000 00001010
       补码：00000000 00000000 00000000 00001010
        a+b：11111111 11111111 11111111 11110110   
  有符号整数：10000000 00000000 00000000 00001010 = -10
    最终结果：-10
    */
    printf("%d\n",a+b);
}

void test2(){
    unsigned int i;
    /*
        unsigned，无符号整数，其值恒大于0
        而循环的结束条件>=0,所以陷入死循环
    */
    for (i = 9; i >= 0; i--)
	    printf("%u ",i);
}

void test3(){
    char a[1000];
    int i;
    /*
    有符号char的取值范围：-128 到 127 共256个数
    正整数范围：   0 到 127
    负整数范围：-128 到 -1
    char只有8位,超出范围会数据截断然后重新进入这个范围
    
    -1-i:-1,-2...-127;-128,-129...-256;...
    a[i]:-1,-2...-127;-128, 127...  0 ;...
    
    -1补码：   11111111 11111111 11111111 11111111 -> 截断后：11111111 = -1
    -127补码： 11111111 11111111 11111111 10000001 -> 截断后：10000001 = -127
    -128补码： 11111111 11111111 11111111 10000000 -> 截断后：10000000 = -128
    -129补码： 11111111 11111111 11111111 01111111 -> 截断后：11111111 = 127
    -256补码： 11111111 11111111 11111111 00000000 -> 截断后：00000000 = 0

	一直在-1到-128，127到0之间循环
    strlen遇到\0(0,不包括)停止,所以-1到-256，共256-1=255个有效数据
    最终结果：255
    */
  
    for (i = 0; i < 1000; i++)
	    a[i] = -1 - i;
    printf("%d\n", strlen(a));
}

void test4(){
    unsigned char a=0;
	for(a=0;a<=255;a++)
		printf("hello word!\n");
    /*
    unsigned char 最大值11111111 = 255，其值恒小于0(超出范围会数据截断)
    循环的条件<=255,所以会陷入死循环
    */
}

int main(){
    //test1();
    //test2();
    test3();
    //test4();
    return 0;
}