#include<stdio.h>
/*
    进阶篇
    浮点型数据的存储-表示,编码,解码

    任何一个浮点数都可以表示为:(-1)^S * M * 2^E
    S符号位:0为正，1则为负
    M有效数字:M>=1且<2
    E尾数指数:8位无符号数
*/

void test1(){
    float a=5.5;
    printf("a=%f,表现形式是什么，如何编码(存储)和解码(取出)?\n",a);
    /*
        5.5D=101.1B

        IEEE754:SME
        (-1)^0 * 1.011 * 2^2
        S=0,M=1.011,E=2

        编码：SEM
        S=0
        M=011000...(补齐23位)
        E=2+127=129=10000010
        所以编码为:0 10000010 011000000000000000000000

        解码：SME
        S逆=0;
        E逆=129-127=2
        M逆=1.011000....
        所以解码为:-1(0) * 1.011000... * 2^2 = 101.1B = 5.5D
    */
}

void test2(){
    float b=0.5;
    printf("b=%f,表现形式是什么，如何编码(存储)和解码(取出)?\n",b);
    /*
        0.5D=0.1B

        IEEE754:SME
        (-1)^0 * 1.0 * 2^(-1)
        S=0,M=1.0,E=-1

        编码：SEM
        S=0
        M=0000...(补齐23位)
        E=-1+127=126=01111110
        所以编码为:0 01111110 000000000000000000000000
    
        解码：SME
        S逆=0
        E逆=126-127=-1
        M逆=1.00...
        
        所以解码为：(-1)^0 * 1.00... * 2^(-1) = 0.1B = 0.5D
    */
}

void test3(){
    //以下程序输出什么结果
    int n = 9;
	float* pFloat = (float*)&n;
	printf("%d\n",n);
	printf("%f\n", *pFloat);
	*pFloat = 9.0;
	printf("%d\n", n);
	printf("%f\n", *pFloat);

    /*
        9D = 00000000 00000000 00000000 00001001B
        整型视角:9
        浮点型视角解析:0 00000000 00000000000000000001001B
        S=0,M=1.00000000000000000001001,E=-127
        解码=(-1)^0 * 0.00000000000000000001001 * 2^(-127) 无穷小接近于0
        (E为全0，整数部分的1则会直接忽略)

        9.0f = 1001.0
        IEEE754:S=0,M=1.001,E=3
        编码：S=0,M=001000...(补齐23位),E=3+127=130
        所以编码=0 10000010 00100000000000000000000
        整型视角:01000001 00010000 00000000 00000000 = 2^30 + 2^24 + 2^20 = 1091567616
        浮点型视角:9.0

        所以最终结果:9,0,1091567616,9.0
    */
}

int main(){
    test3();

    return 0;
}